{
  "backend/main.mo": "Main actor defining types and CRUD operations for vendors, quotation requests, quotations, and purchase requisitions with approval workflows, using in-memory maps for storage and migration support.",
  "backend/migration.mo": "Migration module that preserves existing vendor, quotation request, and quotation data while adding an empty purchase requisitions map for backward compatibility during upgrades.",
  "feature_evidence.json": "Feature evidence report documenting implemented purchase requisition functionality including React Query hooks, form components, table views, and approval workflows with associated test IDs.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend components, pages, and configuration files describing the vendor management, quotation system, and purchase requisition features with earth-tone styling.",
  "frontend/index.css": "Global CSS with Tailwind layers defining earth-tone color palette in OKLCH format for light and dark modes, including sidebar, chart, and component-specific design tokens.",
  "frontend/index.html": "HTML entry point with root div and module script reference to main.tsx for the Supply Chain Management App.",
  "frontend/src/App.tsx": "Root application component configuring TanStack Router with routes for vendors, purchase requisitions (list and detail), quotation requests, comparison, and submission pages.",
  "frontend/src/components/AddVendorForm.tsx": "React Hook Form component for creating vendors with validation for company name, contact person, email, phone, address, and category fields, using the useCreateVendor mutation hook.",
  "frontend/src/components/CreatePurchaseRequisitionForm.tsx": "Form component for creating purchase requisitions with dynamic line items, using react-hook-form for validation and field arrays. Calculates total estimated cost and submits to backend via useCreatePurchaseRequisition hook.",
  "frontend/src/components/CreateRequestForm.tsx": "Form component for creating quotation requests with fields for description, quantity, unit of measurement, and delivery date. Uses react-hook-form and submits via useCreateQuotationRequest hook.",
  "frontend/src/components/EditPurchaseRequisitionForm.tsx": "Form component for editing existing purchase requisitions, allowing modification of line items and justification while displaying read-only requester and department info. Uses useUpdatePurchaseRequisition hook for updates.",
  "frontend/src/components/EditVendorForm.tsx": "Form component for editing vendor information including company details, contact info, and status. Pre-populates with existing vendor data and submits updates via useUpdateVendor hook.",
  "frontend/src/components/Layout.tsx": "Main layout component providing header with app branding, navigation, main content outlet, and footer. Uses TanStack Router for navigation and displays current route context.",
  "frontend/src/components/Navigation.tsx": "Navigation bar component with icon-based menu items for vendors, purchase requisitions, quotation requests, comparison, and submission. Highlights active route and uses TanStack Router for navigation.",
  "frontend/src/components/PurchaseRequisitionApproval.tsx": "Component for viewing and managing purchase requisition approval workflow, including submit, approve, and reject actions with dialogs. Displays requisition details, line items, approval history, and status badges.",
  "frontend/src/components/PurchaseRequisitionTable.tsx": "Displays a table of purchase requisitions with filtering by status, showing details like requester, department, cost, and status badges. Supports edit, delete, and view actions with confirmation dialogs.",
  "frontend/src/components/QuotationComparisonTable.tsx": "Renders a comparison table of quotations for a specific request, displaying vendor details, pricing, delivery timelines, and status. Provides actions to shortlist, accept, or reject quotations.",
  "frontend/src/components/QuotationRequestTable.tsx": "Shows a filterable table of quotation requests by status (pending, received, closed), displaying request details like description, quantity, delivery dates, and current status.",
  "frontend/src/components/QuotationSubmissionForm.tsx": "Form component for vendors to submit quotations for pending requests, including unit price, delivery timeline, terms, and validity period with automatic total price calculation.",
  "frontend/src/components/VendorTable.tsx": "Displays all vendors in a table with company details, contact information, status badges, and actions for editing or deleting vendors with confirmation dialogs.",
  "frontend/src/hooks/useActor.ts": "Custom hook that manages the backend actor instance based on Internet Identity authentication state, creating authenticated or anonymous actors and invalidating dependent queries on identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "React hook and provider for Internet Identity authentication on ICP, managing login state, identity persistence, and delegation validation with configurable AuthClient options.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for all backend operations including vendors, quotation requests, quotations, and purchase requisitions with CRUD operations and toast notifications.",
  "frontend/src/index.css": "Tailwind CSS configuration with earth-tone color palette using OKLCH color space, defining CSS variables for light/dark modes with olive green, terracotta, and warm beige accents.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query client and Internet Identity provider, then renders the root App component.",
  "frontend/src/pages/PurchaseRequisitionDetail.tsx": "Detail page for a single purchase requisition that extracts the ID from route params and renders the approval component.",
  "frontend/src/pages/PurchaseRequisitions.tsx": "Purchase requisitions list page with tabbed status filtering, create dialog, and table display for managing requisitions through approval workflow.",
  "frontend/src/pages/QuotationComparison.tsx": "Page for comparing vendor quotations side-by-side with a dropdown to select quotation requests and display comparison table.",
  "frontend/src/pages/QuotationRequests.tsx": "Quotation requests list page with create dialog and table for managing requests sent to vendors.",
  "frontend/src/pages/SubmitQuotation.tsx": "Vendor-facing page with a form for submitting quotations in response to quotation requests.",
  "frontend/src/pages/VendorManagement.tsx": "Vendor management page with add vendor dialog and table for managing supplier network and relationships.",
  "frontend/tailwind.config.js": "Tailwind configuration extending default theme with custom OKLCH color system, container settings, Inter/JetBrains Mono fonts, and animation utilities for accordion components.",
  "project_state.json": "Project state file tracking a purchase requisition system with approval workflow features. Contains existing features for React Query hooks, form components, table displays, approval workflows, and navigation integration with status tracking (Draft, PendingApproval, Approved, Rejected)."
}